ErpTest/src/AccumulationRegisters/уатБилетыНаСкладах/уатБилетыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатБилетыНаСкладах</name>
  <comment>(уат)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Билет</name>
    <type>
      <types>CatalogRef.уатБилеты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.уатБилетныйЛист</types>
      <types>DocumentRef.уатПоступлениеБилетов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/AccumulationRegisters/уатПланРаботыТС/уатПланРаботыТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатПланРаботыТС</name>
  <comment>План работы ТС</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <comment>Количество</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <comment>НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Приоритет</name>
    <comment>Приоритет</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидБилета</name>
    <comment>Вид билета</comment>
    <type>
      <types>CatalogRef.уатВидыБилетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДетализацияПланирования</name>
    <comment>Детализация планирования</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>CatalogRef.уатМоделиТС</types>
      <types>CatalogRef.ТипыТранспортныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <comment>Договор</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПланирования</name>
    <comment>Документ планирования</comment>
    <type>
      <types>DocumentRef.уатПланированиеРаботыТС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <comment>Заказ на ТС</comment>
    <type>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <comment>Контрагент</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маршрут</name>
    <comment>Маршрут</comment>
    <type>
      <types>CatalogRef.уатМаршруты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрВыработки</name>
    <comment>Параметр выработки</comment>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <comment>Сценарий</comment>
    <type>
      <types>CatalogRef.уатСценарииПланирования</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/AccumulationRegisters/уатЗатратыТС/уатЗатратыТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатЗатратыТС</name>
  <comment>Затраты на транспортные средства (уат)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <comment>Сумма</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Затрата</name>
    <comment>Затрата</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СерииНоменклатуры</types>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>CatalogRef.УзлыОбъектовЭксплуатации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <comment>Контрагент</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <comment>Подразделение</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <comment>Статья затрат</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТС</name>
    <comment>ТС</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/AccumulationRegisters/уатВыручка/уатВыручка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатВыручка</name>
  <comment>(уат)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <comment>Сумма</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КомиссияАвтостанции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Автостанция</name>
    <type>
      <types>CatalogRef.уатПунктыНазначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Билет</name>
    <type>
      <types>CatalogRef.уатБилеты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.уатМаршруты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПутевойЛист</name>
    <type>
      <types>DocumentRef.уатПутевойЛист</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТС</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/Enums/СпособыОценки/СпособыОценки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОценки</name>
  <enumValues>
    <name>ПоСредней</name>
  </enumValues>
  <enumValues>
    <name>ФИФО</name>
    <comment>First input, first output (первым пришел, первым обработан)</comment>
  </enumValues>
  <enumValues>
    <name>ЛИФО</name>
    <comment>Last input, first output (последним пришел, первым обработан)</comment>
  </enumValues>
</mdclass:Enum>

ErpTest/src/CommonModules/уатПроведение_проф/Module.bsl
//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ТАБЛИЦ ДАННЫХ ДЛЯ ВЫПОЛНЕНИЯ ДВИЖЕНЕЙ

// Функция выполняет формирование таблицы партий для списания билетов
//
// Параметры:
//  ТаблицаБилетов - таблица билетов для которой необходимо получить списываемые партии
//                 должно содержать 3 колонки: билет, списываемое количество, склад с которого выполняется
//                 списание
// СпособСписанияПартий - способ списания партий: фило, либо, по средней - значение перечисления
// МоментВремени        - Момент времени на который получаются остатки партий
//
// Возвращаемое значение:
//  Таблица списываемых партий в формате: билет, склад, партия,  количество
//
Функция ПолучитьТаблицуПартийБилетовДляСписания(ТаблицаБилетов, СпособСписанияПартий, МоментВремени = Неопределено) Экспорт
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	ВремТаб.Билет,
	|	ВремТаб.Количество,
	|	ВремТаб.Склад
	|ПОМЕСТИТЬ ТаблицаБилетов
	|ИЗ
	|	&ТаблицаПараметр КАК ВремТаб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаБилетов.Билет,
	|	ТаблицаБилетов.Склад,
	|	СУММА(ТаблицаБилетов.Количество) КАК Количество
	|ПОМЕСТИТЬ ТаблицаБилетовГруппировка
	|ИЗ
	|	ТаблицаБилетов КАК ТаблицаБилетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаБилетов.Билет,
	|	ТаблицаБилетов.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	мЗапрос.УстановитьПараметр("ТаблицаПараметр", ТаблицаБилетов);
	Если МоментВремени = Неопределено тогда 
		мЗапрос.УстановитьПараметр("МоментВремени", Дата('00010101'));
	Иначе
		мЗапрос.УстановитьПараметр("МоментВремени", МоментВремени);
	КонецЕсли;
		
	Если СпособСписанияПартий = Перечисления.СпособыОценки.ПоСредней тогда
		мЗапрос.Текст = мЗапрос.Текст + "
		|ВЫБРАТЬ
		|	Билеты.Билет,
		|	Билеты.Количество,
		|	Билеты.Склад
		|ИЗ
		|	ТаблицаБилетовГруппировка КАК Билеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатБилетыНаСкладах.Остатки(
		|				&МоментВремени,
		|				Склад В (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							мТаб.Склад
		|						ИЗ
		|							ТаблицаБилетов КАК мТаб)
		|					И Билет В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							мТаб.Билет
		|						ИЗ
		|							ТаблицаБилетов КАК мТаб
		|						)) КАК уатБилетыНаСкладахОстатки
		|		ПО Билеты.Склад = уатБилетыНаСкладахОстатки.Склад
		|			И Билеты.Билет = уатБилетыНаСкладахОстатки.Билет
		|;";
		МассивРезультатов = мЗапрос.ВыполнитьПакет();
		тблПартий = МассивРезультатов[2].Выгрузить();
		тблПартий.Колонки.Добавить("Партия", Метаданные.РегистрыНакопления.уатБилетыНаСкладах.Измерения.Партия.Тип);
		
		Возврат тблПартий;
		
	Иначе
		мЗапрос.Текст = мЗапрос.Текст + 
		"ВЫБРАТЬ
		|	Билеты.Билет,
		|	Билеты.Склад,
		|	Билеты.Количество,
		|	уатБилетыНаСкладахОстатки.Партия КАК Партия,
		|	ЕСТЬNULL(уатБилетыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоПартия,
		|	ЕСТЬNULL(уатБилетыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОсталось
		|ИЗ
		|	ТаблицаБилетовГруппировка КАК Билеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатБилетыНаСкладах.Остатки(
		|				&МоментВремени,
		|				Склад В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							мТаб.Склад
		|						ИЗ
		|							ТаблицаБилетов КАК мТаб)
		|					И Билет В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							мТаб.Билет
		|						ИЗ
		|							ТаблицаБилетов КАК мТаб)) КАК уатБилетыНаСкладахОстатки
		|		ПО Билеты.Билет = уатБилетыНаСкладахОстатки.Билет
		|			И Билеты.Склад = уатБилетыНаСкладахОстатки.Склад
		|
		|УПОРЯДОЧИТЬ ПО
		|	уатБилетыНаСкладахОстатки.Партия.МоментВремени";

		Если СпособСписанияПартий = Перечисления.СпособыОценки.ЛИФО Тогда
			мЗапрос.Текст = СтрЗаменить(мЗапрос.Текст, "уатБилетыНаСкладахОстатки.Партия.МоментВремени",
				"уатБилетыНаСкладахОстатки.Партия.МоментВремени Убыв");
		КонецЕсли;
		
        МассивРезультатов = мЗапрос.ВыполнитьПакет();
		
		ТаблицаОстатковПартий = МассивРезультатов[2].Выгрузить();
		ТаблицаПартий = Новый ТаблицаЗначений();
		ТаблицаПартий.Колонки.Добавить("Склад"       , Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ТаблицаПартий.Колонки.Добавить("Билет", Новый ОписаниеТипов("СправочникСсылка.уатБилеты"));
		ТаблицаПартий.Колонки.Добавить("Партия"      , Метаданные.РегистрыНакопления.уатБилетыНаСкладах.Измерения.Партия.Тип);
		ТаблицаПартий.Колонки.Добавить("Количество"  , Новый ОписаниеТипов("Число"),Новый КвалификаторыЧисла(15,2));
				
		Для каждого ТекСтрокаТабБилетов ИЗ ТаблицаБилетов Цикл
			ОсталосьСписать = ТекСтрокаТабБилетов.Количество;	
			Для каждого ТекСтрокаОстатковПартий ИЗ ТаблицаОстатковПартий Цикл
				Если ОсталосьСписать = 0 ТОгда
					Прервать;
				КонецЕсли;
				Если ТекСтрокаТабБилетов.Склад = ТекСтрокаОстатковПартий.Склад 
				   И ТекСтрокаТабБилетов.Билет = ТекСтрокаОстатковПартий.Билет
				   И ТекСтрокаОстатковПартий.КоличествоОсталось > 0 тогда
					СписатьКоличество = Мин(ТекСтрокаОстатковПартий.КоличествоОсталось, ОсталосьСписать);
					Если СписатьКоличество = 0 тогда 
						Продолжить;
					КонецЕсли;
					НовСтрока = ТаблицаПартий.Добавить();
					НовСтрока.Склад        = ТекСтрокаОстатковПартий.Склад;
					НовСтрока.Билет = ТекСтрокаОстатковПартий.Билет;
					НовСтрока.Партия       = ТекСтрокаОстатковПартий.Партия;
					НовСтрока.Количество   = СписатьКоличество;
					
					ОсталосьСписать = ОсталосьСписать - СписатьКоличество;
					ТекСтрокаОстатковПартий.КоличествоОсталось  = ТекСтрокаОстатковПартий.КоличествоОсталось - СписатьКоличество;
				Иначе
					Продолжить;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ОсталосьСписать > 0 тогда
				НовСтрока = ТаблицаПартий.Добавить();
				НовСтрока.Склад      = ТекСтрокаТабБилетов.Склад;
				НовСтрока.Билет      = ТекСтрокаТабБилетов.Билет;
				НовСтрока.Партия     = Неопределено;
				НовСтрока.Количество = ОсталосьСписать;
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат ТаблицаПартий;
	КонецЕсли;

КонецФункции


//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ДВИЖЕНИЙ РЕГИСТРОВ

// Выполняет движения регистра сведений Местонахождение ТС
//
Процедура ОтразитьМестонахождениеТС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаМестонахожденияТС = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаМестонахожденияТС;
	
	Если Отказ ИЛИ ТаблицаМестонахожденияТС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСостояние = Движения.уатМестонахождениеТС;
	ДвиженияСостояние.Записывать = Истина;
	ДвиженияСостояние.Загрузить(ТаблицаМестонахожденияТС);

КонецПроцедуры

// Выполняет движения регистра сведений Прейскуранты ТС
//
Процедура ОтразитьПрейскурантыТС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПрейскурантыТС = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПрейскурантыТС;
	
	Если Отказ ИЛИ ТаблицаПрейскурантыТС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСостояние = Движения.уатПрейскурантыТС;
	ДвиженияСостояние.Записывать = Истина;
	ДвиженияСостояние.Загрузить(ТаблицаПрейскурантыТС);

КонецПроцедуры

// Выполняет движения регистра сведений Тарифы ЗП сотрудников
//
Процедура ОтразитьТарифыЗП(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаТарифыЗП = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТарифыЗП;
	
	Если Отказ ИЛИ ТаблицаТарифыЗП.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСостояние = Движения.уатТарифыСотрудников;
	ДвиженияСостояние.Записывать = Истина;
	ДвиженияСостояние.Загрузить(ТаблицаТарифыЗП);

КонецПроцедуры

// Выполняет движения регистра сведений План работы ТС
//
Процедура ОтразитьПланРаботыТС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПланаРаботыТС = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПланаРаботыТС;
	
	Если Отказ ИЛИ ТаблицаПланаРаботыТС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияОборотыПоЗаправкамГСМ = Движения.уатПланРаботыТС;
	ДвиженияОборотыПоЗаправкамГСМ.Записывать = Истина;
	ДвиженияОборотыПоЗаправкамГСМ.Загрузить(ТаблицаПланаРаботыТС);

КонецПроцедуры

// Выполняет движения регистра сведений зависимости оборотов по затратам по видам перевозок
//
Процедура ОтразитьЗатратыТС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗатратыТС;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатЗатратыТС;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры

// Выполняет движения регистра накопления Выручка
//
Процедура ОтразитьВыручку(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВыручка;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатВыручка;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры

// Выполняет движения регистра накопления Билеты на складах
//
Процедура ОтразитьБилетыНаСкладах(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	мТаблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаБилетыНаСкладах;
	
	Если Отказ ИЛИ мТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыработка = Движения.уатБилетыНаСкладах;
	ДвиженияВыработка.Записывать = Истина;
	ДвиженияВыработка.Загрузить(мТаблица);

КонецПроцедуры
